app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    STDERR.puts user_params.merge(role: Random.rand%2 == 0?'admin':'user').inspect

    #If you are lucky - you are admin! (50% chance)
    @user = User.new user_params.merge(role: Random.rand%2 == 0?'admin':'user')

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_user
    @user = User.find params[:id] if params[:id]